In [62]:
##First step is to import pandas

import pandas as pd
import numpy as np

In [63]:
#playing with dataframes
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['row1','row2','row3','row4','row5'], columns =['column1','column2','column3','column4'])

In [64]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [65]:
#Acessing the elements

df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [66]:
#check the type
type(df.loc['row1'])

pandas.core.series.Series

In [68]:
df.iloc[:,:]

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [69]:
df.iloc[:,1:]

      column2  column3  column4
row1        1        2        3
row2        5        6        7
row3        9       10       11
row4       13       14       15
row5       17       18       19

In [71]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [72]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [73]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [74]:
from io import StringIO, BytesIO

In [75]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [76]:
print(data)

col1,col2,col3
x,y,1
a,b,2
c,d,3

In [77]:
type(data)

str

In [78]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [82]:
df = pd.read_csv(StringIO(data), usecols= ['col1','col3'])

In [83]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [84]:
df.to_csv('Test.csv')

In [85]:
#specifying column data type

data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11')

In [87]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [88]:
df=pd.read_csv(StringIO(data),dtype=object)

In [89]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [90]:
df['a'][1]

'5'

In [93]:
df = pd.read_csv(StringIO(data), dtype={'b':int,'c':float,'a':'Int64'})

In [94]:
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [95]:
df['a'][1]

5

In [96]:
df.iloc[:2,:2]

   a  b
0  1  2
1  5  6

In [103]:
df['a'][:2]

0    1
1    5
Name: a, dtype: Int64

In [104]:
df.dtypes

a      Int64
b      int32
c    float64
d    float64
dtype: object

In [105]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [106]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [111]:
data = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [112]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [113]:
pd.read_csv(StringIO(data), index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [114]:
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [116]:
pd.read_csv(StringIO(data), escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5